from sklearn.feature_extraction.text import CountVectorizer
from kiwipiepy import Kiwi
import re
from nltk.corpus import stopwords

# 불용어를 정의한다
user_stop_word = ['가', '가까스로', '가끔', '가령', '가서', '가장', '각', '각각', '각기', '각자', '각종', '각하', '간', '갖고말하자면', '같다', '같다면', '같은', '같이', '개', '거나', '거니와', '거리', '거바', '거의', '걸', '겁', '것', '것과', '게다가', '게우다', '겨우', '견지', '결과', '결국', '결론', '겸사겸사', '계속', '고려', '고로', '곤', '곧', '곳', '공동', '과', '과연', '관', '관계', '관계없이', '관련', '관해', '구', '구체', '구토', '그', '그간', '그것', '그녀', '그동안', '그때', '그래', '그래도', '그래서', '그러나', '그러니', '그러니까', '그러면', '그러므로', '그러한', '그런', '그런데', '그럼', '그럼에도', '그렇게', '그렇다면', '그렇지', '그렇지만', '그리고', '그리하여', '그만큼', '그저', '그치지', '근거', '근본', '기대', '기점', '기준', '기타', '김', '까닭', '까악', '까지', '까지도', '꼭', '꽈당', '끙끙', '끼익', '나', '나머지', '나서', '남', '남짓', '낫다', '낼', '너', '너희', '네', '넷', '년', '년도', '논', '놀라다', '누가', '누구', '는', '다', '다른', '다를가', '다만', '다섯', '다소', '다수', '다시', '다시말하면', '다음', '단지', '달', '달려', '답', '당신', '당장', '대로', '대하', '대한', '대해', '댕그', '더', '더구나', '더군다나', '더라도', '더불어', '더욱더', '더욱이', '도', '도달', '도착', '동시', '동안', '됏', '되는', '되다', '되면', '되어', '된', '된다', '될것이다', '됸다', '두', '두번째', '둘', '둥둥', '뒤', '뒤따라', '드디어', '든', '든지', '들', '들면', '들자면', '듯', '등', '등등', '딩동', '따라', '따라서', '따르는', '따름', '따위', '따지지', '딱', '때', '때문', '또', '또는', '또한', '뚝뚝', '라', '라도', '라면', '령', '로', '로부터', '로써', '루', '륙', '를', '리하', '마는', '마다', '마디', '마음대로', '마자', '마저', '마저도', '마치', '마침내', '마흔', '막론', '만', '만약', '만으로', '만은', '만이', '만일', '만큼', '만하', '많은', '많이', '말', '말하자면', '망정', '매', '매번', '매우', '메', '면', '몇', '모', '모두', '모든', '모른다', '몰라도', '몰랏다', '못', '무렵', '무릎', '무슨', '무엇', '물론', '뭐', '뭔가', '미치다', '및', '바', '바꾸어말하면', '바꾸어말하자면', '바꾸어서', '바꿔', '바로', '밖에', '반대', '반드시', '반면', '방면', '버금', '번째', '보는데서', '보다', '보다도', '보드득', '보면', '보아', '본대', '봐', '봐라', '부류', '부터', '불구', '불문', '붕붕', '비', '비걱거리', '비교', '비길수', '비로소', '비록', '비롯', '비슷하다', '비추어', '뿐', '삐걱', '사', '사람', '사이', '삼', '상대', '생각', '서', '서른', '서술', '설령', '설마', '설사', '섭외', '세', '셋', '소생', '소인', '솨', '수', '쉰', '쉿', '습니까', '습니다', '시각', '시간', '시오', '시작', '시초', '시키다', '실로', '심지어', '쓰', '쓰고', '쓰여', '아', '아니', '아니나', '아니다', '아니라', '아니라면', '아니면', '아니었다면', '아래', '아무', '아야', '아울러', '아이', '아이고', '아이구', '아이야', '아이쿠', '아주', '아하', '아홉', '아흔', '안', '안다', '안된다', '않고', '않기', '않는', '않는다면', '않다', '않다면', '않도록', '않으면', '알', '알겠는가', '알다', '알았어', '앗', '앞', '야', '약간', '양자', '어', '어기', '어느', '어디', '어때', '어떠한', '어떤', '어떤것', '어떻게', '어떻해', '어이', '어째서', '어쨋', '어쩔', '어찌', '어찌됏', '어찌하여', '언제', '언젠가', '얼마', '얼마간', '얼마나', '얼마만큼', '없고', '없다', '엉엉', '에', '에게', '에도', '에서', '에야', '엔', '여', '여기', '여덟', '여든', '여러분', '여보', '여부', '여섯', '여전히', '연', '연관', '열', '였다', '영', '영차', '옆', '예', '예순', '예컨대', '오', '오로지', '오르다', '오직', '오호', '오히려', '와', '와같이', '와르르', '와아', '왜', '왜냐하면', '외', '요', '요만', '요컨대', '우', '우르르', '우리', '우선', '운운', '월', '웬', '웬만하면', '웬만한', '위', '위해', '윗', '윙윙', '육', '으로', '으로서', '으로써', '은', '을', '응', '응당', '의', '의거', '의지', '의치', '의해', '의해서', '이', '이내', '이다', '이라고', '이래', '이러', '이러므로', '이러하다', '이러한', '이런', '이럴', '이렇게', '이렇구나', '이로', '이르기까지', '이르다', '이만', '이번', '이상', '이서', '이십', '이어', '이어서', '이었고', '이었다', '이외', '이용', '이유', '이전', '이지만', '이천구', '이천육', '이천칠', '이천팔', '이하', '이후', '인', '인가', '인젠', '인하여', '일', '일것이다', '일곱', '일단', '일반', '일부', '일지', '일흔', '임', '입', '입어', '입장', '잇따라', '있다', '자', '자기', '자마자', '자신', '잠깐', '잠시', '저', '저기', '저런', '저렇게', '저쪽', '저희', '적', '전부', '전자', '전혀', '전후', '점', '정도', '제', '제각기', '제외', '젠', '조금', '조차', '조차도', '졸졸', '좀', '종합', '좋다', '좋아', '좍좍', '주룩주룩', '주일', '주저', '줄', '중', '즈음', '즉', '즉시', '지', '지경', '지든지', '지만', '지말고', '진짜', '집', '쪽', '차', '차라리', '참', '참나', '처럼', '첫', '쳇', '초', '총', '칠', '켠으로는', '콸콸', '쾅쾅', '쿵', '큼', '타다', '타인', '탕탕', '토', '통', '툭', '퉤', '틀림없다', '틈타', '팍', '팔', '퍽', '펄렁', '편이', '하', '하게', '하게하다', '하겠는가', '하고', '하고있다', '하고있었다', '하구나', '하기', '하기는', '하기는한데', '하기만', '하기보다는', '하기에', '하나', '하느니', '하는', '하는것도', '하는것만', '하는것이', '하다', '하더라도', '하도다', '하도록', '하든', '하든지', '하려고하다', '하루', '하마터면', '하며', '하면', '하면서', '하물며', '하여', '하여금', '하여야', '하였다', '하자', '하자면', '하지', '하지마', '하지마라', '하지만', '하하', '한', '한다', '한다면', '한데', '한마디', '한적', '한편', '한하다', '할', '할것도', '할수록', '할수있다', '할수있어', '할줄', '할지라도', '할지언정', '함', '함께', '항목', '해', '해도', '해봐라', '해봐요', '해서', '해서는', '해야', '했어요', '향', '허', '허걱', '허허', '헉', '헉헉', '헌', '헐떡헐떡', '형식', '혹시', '혹은', '혼자', '후', '훨씬', '휘익', '휴', '흐흐', '흥', '힘']
en_stop_words = set(stopwords.words('english')) 

# 토크나이저에 명사만 추가한다
extract_pos_list = ["NNG", "NNP", "NNB", "NR", "NP"]

class CustomTokenizer:
  def __init__(self, kiwi):
    self.kiwi = kiwi

  def __call__(self, text):
    result = list()
    # 한국어 토큰화
    for word in self.kiwi.tokenize(text):
      if word[1] in extract_pos_list and len(word[0]) > 1 and word[0] not in user_stop_word:
        result.append(word[0])
    # 영어 토큰화 (정규 표현식으로 단어 추출)
    english_words = re.findall(r'\b\w+\b', text)
    result.extend([word for word in english_words if word.lower() not in en_stop_words and len(word) > 1])
    return result

def create_vectorizer():
    custom_tokenizer = CustomTokenizer(Kiwi())
    vectorizer = CountVectorizer(tokenizer=custom_tokenizer, max_features=300)
    return vectorizer
